[{"name":"Dokumentation","description":"Hier finden Sie die Dokumentation für das SNIK Tag Tool","path":"/Dokumentation","text":"","wordCount":0,"type":"TOC"},{"name":"Was gibts neues?","description":"Neue Entwicklungen, Versionen und Visionen","path":"/Dokumentation/whatsNew","text":"Hier finden Sie Informationen zu Neuigkeiten im Projekt, zu neuen Funktionalitäten und Ideen für künftige Entwicklungen.\nBitte besuchen Sie diese Seite von Zeit zu Zeit, um auf dem Laufenden zu bleiben.\n\n21.08.2019 Start der Dokumentation\n Die Dokumentation wird mit Hilfe des Git Playbook von Thomas Reinecke erstellt.\n","wordCount":44,"type":"Content"},{"name":"Prozess Dokumentation","description":"Alles über das Arbeiten mit dem SNIK Tag Tool","path":"/Dokumentation/process","text":"","wordCount":0,"type":"TOC"},{"name":"Einführung","description":"Wie Sie diese Dokumentation lesen sollten","path":"/Dokumentation/process/introduction","text":"\nEinführung und allgemeine Hinweise und Tipps zum SNIK TAG Tool\n\nDie Dokumentation richtet sich hauptsächlich an Anwender.\n\nBitte nutzen Sie die Schritt für Schritt Anleitung um sich ein Gesamtbild der Funktionalitäten des SNIK TAG Tools zu erarbeiten.\n\nVoraussetzung für die sinnvolle Nutzung des Tools ist eine Word-Datei (docx-Format) mit folgenden Vorbereitungen:\nEntity Types sind kursiv,\nRoles sind fett und\nFunctions sind unterstrichen dargestellt\n\nErläuterung der Reiter\nText: hier wird der formatierte Text angezeigt und man kann interaktiv Verbindungen definieren und hinzufügen\nKlassen: eine tabellarische Aufstellung der Klassen mit ihren Labels, lokalen Namen, des Typs und Funktionen zum Entfernen und Zusammenführen; außerdem können hier Namen im Freitext beliebig verändert werden.\nVerbindungen: eine Darstellung der semantischen Beziehungen (Subjekt, Relation, Objekt) und der Funktion zum Entfernen einzelner Einträge\nRDF: Darstellung des generierten Outputs im turtle-Format\n\nDas SNIKT-Format\nZum Zwischenspeichern von bereits bearbeiteten Tags und Relationen wurde eine neues Dateiformat definiert, welches allerdings momentan noch nicht versionsübergreifend funktioniert.\nDaher ist bei Versionsupdates des SNIK Tag Tools Vorsicht geboten, es droht Datenverlust!\n\nGrafische Anzeige der erzeugten Triples im SNIK Graph\nUm sich das Ergebnis zu visualisieren speichern Sie die Triples als JSON Datei (Datei -> Cytoscape JSON exportieren ODER STRG+J) ab.\nAnschließend öffnen Sie den SNIK Graph im Browser. Wenn dieser fertig geladen ist, laden Sie über File -> Load Graph with Layout die zuvor gespeicherte JSON Datei in die Visualisierung.\n\ndocx öffnen\nändern\nverknüpfungen einfügen\nals .snikt speichern (für späteres weiterarbeiten) --> Vorsicht bei Updates\nzum Anschauen im Graph als .json Datei speicher und in Graph laden\nLabels, local names und Types können geändert werden\nmerge von rows beschreiben\nevtl Type spalte schmaler?\ndeutsch\n","wordCount":244,"type":"Content"},{"name":"Schritt für Schritt","description":"Ein Rundgang durch das SNIK TAG Tool","path":"/Dokumentation/process/StepByStep","text":"Schritt 1: Textdatei öffnen und laden\nUnter Datei -> DOCX Datei öffnen (oder STRG+D) die zu bearbeitende Word-Datei im docx-Format öffen.\nDie Datei wird automatisch entsprechend der gesetzten Markierungen formatiert und in das Tool geladen.\n\nSchritt 2: Hinzufügen von Verbindungen\nEs gibt prinzipiell 2 Möglichkeiten: über Listen oder interaktiv im Text\n\nListen:\nIm rechten Teil der Anzeige finden Sie 2 Dropdown Menüs, hier können Sie das gewünschte Subjekt bzw Objekt auswählen.\nAnschließend muss noch im Dropdown-Menü Verbindung auswählen die passende Beziehung ausgewählt werden. Das SNIK TAG Tool stellt dabei automatisch nur die laut dem Metamodell relevanten Verbindungen zur Verfügung.\n\nInteraktiv im Text:\nDas Subjekt wird per Klick mit linker Maustaste, das Objekt per Klick mit rechter Maustaste ausgewählt, die Verbindung wird analog zu Punkt 1 defniert.\n\nSchritt 3: sülz\n","wordCount":119,"type":"Content"},{"name":"Hilfreiche Links","description":"Wie gehts von hier aus weiter ?","path":"/Dokumentation/links","text":"Hier finden Sie eine Sammlung relevanter Links\n\nSNIK TAG Tool Git Repo\nSNIK Homepage\nSNIK Graph\nHomepage IMISE Leipzig\n","wordCount":15,"type":"Content"},{"name":"FAQs","description":"Häufig gestellte Fragen sind hier gesammelt","path":"/Dokumentation/faq","text":"An dieser Stelle werden häufig auftretende Fragen beantwortet.\n\nBislang ist diese Sammlung leer.\n\nFür weitere Fragen senden Sie bitte eine Mail.\n","wordCount":19,"type":"Content"}]